_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_ШаблоныСтроительныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_ШаблоныСтроительныхРабот</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ШаблоныСтроительныхРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСводногоСметногоРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтатьиСводныхСметныхРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Конструктив</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРаботыВУровне</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаЕдиницуОбъема</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокНаЕдиницуОбъема</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загрузка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Предшественники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_ШаблоныСтроительныхРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗависимости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ТипыЗависимостейРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задержка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаЗадержки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ПотребностьВМатериалах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ПотребностьВМатериалах</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНаЕдиницуОбъема</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУпаковокНаЕдиницуОбъема</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНаОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУпаковокНаОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыПланированияСтроительныхРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ПотребностьВРесурсах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ПотребностьВРесурсах</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагрузкаПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Трудоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Машиноемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыПланированияСтроительныхРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ПараметрыВыполненияРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ПараметрыВыполненияРабот</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРаботыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРаботыПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыПланированияСтроительныхРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Утверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыПланированияСтроительныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыПланированияСтроительныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месячный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедельноСуточный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_ШаблоныСтроительныхРабот/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ВводНаОсновании

Процедура ЗаполнитьШаблонНаОснованииРаботы(Приемник, Источник, тзСоответствия = Неопределено) Экспорт
	 	
	ЗаполнитьСвязиВЭтойПроцедуре = Ложь;
	
	Если тзСоответствия = Неопределено Тогда
		тзСоответствия = Новый ТаблицаЗначений;
		тзСоответствия.Колонки.Добавить("Приемник");
		тзСоответствия.Колонки.Добавить("Источник"); 	    
		ЗаполнитьСвязиВЭтойПроцедуре = Истина;
	КонецЕсли; 
	
	спрРаботы = Справочники.УСОERP_СтроительныеРаботы;
	спрШаблоны = Справочники.УСОERP_ШаблоныСтроительныхРабот;
	
	// Проверяем возможность заполнения - есть ли у источника потомки - если есть, заполнять нельзя
	ВыборкаПотомковПоПриемнику = спрШаблоны.Выбрать(Приемник.Ссылка);
	
	ВыборкаПотомковПоИсточнику = спрРаботы.Выбрать(Источник,,,"НомерРаботыВУровне");
	
	Если ВыборкаПотомковПоПриемнику.Следующий() Тогда
		ТекстСообщения = "У шаблона " + СокрЛП(Приемник.Наименование) + " заданы потомки. Копирование невозможно";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	// переносим реквизиты
	ЗаполнитьОбъектНаОсновании(Приемник,Источник);
	
	// дозаполняем реквизитами, хранящимися в регистрах
	Если Источник.Владелец.НовыйВариант Тогда
		
		Приемник.ОбъемРаботы 		 = Источник.ОбъемРаботы;
		Приемник.ЕдиницаОбъема       = Источник.ЕдиницаОбъема;
		Приемник.ДлительностьПлан	 = Источник.Длительность;
		Приемник.ЕдиницаДлительности = Источник.ЕдиницаДлительности;
		
	Иначе
		
		ПараметрыВыполненияРаботы = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПараметрыВыполненияРаботы(Источник, Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный, ТекущаяДата()); 
		Приемник.ОбъемРаботы 		 = ПараметрыВыполненияРаботы.ОбъемРаботы;
		Приемник.ЕдиницаОбъема       = ПараметрыВыполненияРаботы.ЕдиницаОбъема;
		Приемник.ДлительностьПлан	 = ПараметрыВыполненияРаботы.ДлительностьПлан;
		Приемник.ЕдиницаДлительности = ПараметрыВыполненияРаботы.ЕдиницаДлительности;
		
	КонецЕсли;
	
	Приемник.НомерРаботыВУровне = Источник.НомерРаботыВУровне;
	
	Приемник.Записать();
	// переписываем потомков
	Пока ВыборкаПотомковПоИсточнику.Следующий() Цикл
		
		Если ВыборкаПотомковПоИсточнику.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;	
		
		ИсточникДляПотомка = ВыборкаПотомковПоИсточнику.Ссылка;
		
		Если ИсточникДляПотомка.СуммарнаяРабота Тогда
			НовыйШаблон = Справочники.УСОERP_ШаблоныСтроительныхРабот.СоздатьГруппу();
		Иначе
			НовыйШаблон = Справочники.УСОERP_ШаблоныСтроительныхРабот.СоздатьЭлемент();
		КонецЕсли; 
		           
		НовыйШаблон.Наименование = ИсточникДляПотомка.Наименование;
		НовыйШаблон.Родитель 			 = Приемник.Ссылка;
		НовыйШаблон.НомерРаботыВУровне = ИсточникДляПотомка.НомерРаботыВУровне;
		НовыйШаблон.Записать();
		Нстр = тзСоответствия.Добавить();
		Нстр.Приемник = НовыйШаблон.Ссылка;
		Нстр.Источник = ИсточникДляПотомка.Ссылка;
		ЗаполнитьШаблонНаОснованииРаботы(НовыйШаблон,ИсточникДляПотомка,тзСоответствия);
		
	КонецЦикла; 
	
КонецПроцедуры

//В процедуре заполняем Объект-Приемник на основании Объекта-Источника
//реквизиты переносим при совпадении наименований, аналогично с табличными частями
Процедура ЗаполнитьОбъектНаОсновании(Приемник,Источник) Экспорт
	
	Если НЕ ТипЗнч(Источник) = Тип("Структура") Тогда
		
		ИсточникМетаданные = Источник.Метаданные();
		ПриемникМетаданные = Приемник.Метаданные();
		
		// Переносим реквизиты
		Для Каждого Реквизит Из ПриемникМетаданные.Реквизиты Цикл
			РеквизитИсточник = ИсточникМетаданные.Реквизиты.Найти(Реквизит.Имя);
			Если РеквизитИсточник <> Неопределено Тогда 			
				Приемник[Реквизит.Имя] = Источник[Реквизит.Имя];
			КонецЕсли;
		КонецЦикла;
		
		Если ТипЗнч(Приемник) = Тип("СправочникОбъект.УСОERP_СтроительныеРаботы") Тогда
			Если НЕ Источник.ЭтоГруппа Тогда
				Приемник.Длительность = Источник.ДлительностьПлан;
			КонецЕсли;
			Если Приемник.Владелец.НовыйВариант И НЕ Источник.ЭтоГруппа Тогда
				Приемник.Материалы.Загрузить(Источник.Материалы.Выгрузить());
				ТаблицаРесурсов = Источник.Ресурсы.Выгрузить();
				ТаблицаРесурсов.Колонки.Загрузка.Имя = "ЗагрузкаПроцент";
				Приемник.Ресурсы.Загрузить(ТаблицаРесурсов);
			КонецЕсли;
			
		КонецЕсли;
		

		// Заполняем табличные части. Только для справочника Шаблоны строительных работ
		Если (ТипЗнч(Приемник) = Тип("СправочникОбъект.УСОERP_ШаблоныСтроительныхРабот")) И (Приемник.ЭтоГруппа = Ложь) Тогда
			
			Если Источник.Владелец.НовыйВариант Тогда
				ТаблицаМатериалов = Источник.Материалы.Выгрузить();
			Иначе			
				ТаблицаМатериалов = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПотребностьВМатериалах(Источник, Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный, ТекущаяДата());
			КонецЕсли;
			//ТаблицаМатериалов.Колонки.Номенклатура.Имя = "Материал";
			Для Каждого СтрокаМатериал Из ТаблицаМатериалов Цикл
				НоваяСтрока = Приемник.Материалы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМатериал);
			КонецЦикла;
			
			Если Источник.Владелец.НовыйВариант Тогда
				ТаблицаРесурсов = Источник.Ресурсы.Выгрузить();
			Иначе		
				ТаблицаРесурсов = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПотребностьВРесурсах(Источник, Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный, ТекущаяДата());
			КонецЕсли;
		
			ТаблицаРесурсов.Колонки.ЗагрузкаПроцент.Имя = "Загрузка";
			Для Каждого СтрокаРесурс Из ТаблицаРесурсов Цикл
				НоваяСтрока = Приемник.Ресурсы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРесурс);
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

//В этой процедуре копируем шаблон и его потомков в Справочник.УСОERP_СтроительныеРаботы
//
Процедура ЗаполнитьРаботуНаОснованииШаблона(Приемник,Источник,ТаблицаСоответствия = Неопределено) Экспорт
	
	спрРаботы = Справочники.УСОERP_СтроительныеРаботы;
	спрШаблоны = Справочники.УСОERP_ШаблоныСтроительныхРабот;
	
	Если ТаблицаСоответствия = Неопределено Тогда
		
		ТаблицаСоответствия = Новый ТаблицаЗначений;
		ТаблицаСоответствия.Колонки.Добавить("Приемник");
		ТаблицаСоответствия.Колонки.Добавить("Источник");
		
	КонецЕсли;  	
	
	// Проверяем возможность заполнения - есть ли у источника потомки - если есть, заполнять нельзя
	ВыборкаПотомковПоПриемнику = спрРаботы.Выбрать(Приемник.Ссылка,,,"НомерРаботыВУровне");
	ВыборкаПотомковПоИсточнику = спрШаблоны.Выбрать(Источник.Ссылка,,,"НомерРаботыВУровне");
	
	Если ВыборкаПотомковПоПриемнику.Следующий() Тогда
		ТекстСообщения = "У работы " + СокрЛП(Приемник.Наименование) + " Заданы потомки. Копирование невозможно";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	// переносим реквизиты и табличные части
	ЗаполнитьОбъектНаОсновании(Приемник,Источник);  		
	
	Если (ТипЗнч(Приемник) = Тип("СправочникОбъект.УСОERP_СтроительныеРаботы")) Тогда
		ДанныеКода = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьКодСДРИНомерРаботыВУровне(Приемник.Владелец, Приемник.Родитель);
		Приемник.КодСДР  = ДанныеКода.КодСДР;
		Приемник.НомерРаботыВУровне 	= ДанныеКода.НомерРаботыВУровне;
	КонецЕсли;
	
	Если Приемник.Владелец.НовыйВариант Тогда
		
		Приемник.СуммарнаяРабота = Источник.ЭтоГруппа;
		Приемник.НомерРаботыВУровне = Приемник.НомерРаботыВУровне - 1;
		Приемник.КодСДР = "";
		Если Приемник.СуммарнаяРабота Тогда
			Приемник.ДополнительныеСвойства.Вставить("КопированиеСценария");
		КонецЕсли;	
		
	КонецЕсли;  	
	
	Приемник.Записать();
	ПровестиПоРегистрам(Приемник, Источник);
	Нстр = ТаблицаСоответствия.Добавить();
	Нстр.Приемник = Приемник.Ссылка;
	Нстр.Источник = Источник.Ссылка;
	
	// переписываем потомков
	Пока ВыборкаПотомковПоИсточнику.Следующий() Цикл
		
		Если ВыборкаПотомковПоИсточнику.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;	
		ИсточникДляПотомка = ВыборкаПотомковПоИсточнику.Ссылка;
		НоваяРабота = Справочники.УСОERP_СтроительныеРаботы.СоздатьЭлемент();
		НоваяРабота.Наименование = ИсточникДляПотомка.Наименование;
		НоваяРабота.Владелец = Приемник.Владелец;
		НоваяРабота.Родитель = Приемник.Ссылка;
		НоваяРабота.Записать();
		
		ЗаполнитьРаботуНаОснованииШаблона(НоваяРабота,ИсточникДляПотомка,ТаблицаСоответствия);
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСРегистрами

Процедура ПровестиПоРегистрам(Приемник, Источник)
	
	Если Приемник.Владелец.НовыйВариант Тогда
		
		Если Приемник.СуммарнаяРабота Тогда
			Возврат;
		КонецЕсли;
		
		
		Приемник.Материалы.Загрузить(Источник.Материалы.Выгрузить());
		ТабРесурсы = Источник.Ресурсы.Выгрузить();
		ТабРесурсы.Колонки.Загрузка.Имя = "ЗагрузкаПроцент";
		Приемник.Ресурсы.Загрузить(ТабРесурсы);
		
		Приемник.Записать();
		
		Возврат;
		
	КонецЕсли;
	
	
	
	Если Не Источник.ЭтоГруппа Тогда
		Для Каждого СтрокаМатериал Из Источник.Материалы Цикл
			МенеджерЗаписи 	= РегистрыСведений.УСОERP_ПотребностьВМатериалах.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Работа			= Приемник.Ссылка;
			МенеджерЗаписи.ВидПланирования 	= Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный;	
			МенеджерЗаписи.Период			= НачалоДня(ТекущаяДата());
			МенеджерЗаписи.Номенклатура  	= СтрокаМатериал.Номенклатура;
			МенеджерЗаписи.АвторИзмерения   = Пользователи.ТекущийПользователь();
		    МенеджерЗаписи.КоличествоУпаковокНаОбъемРаботы	= Окр(СтрокаМатериал.КоличествоУпаковокНаЕдиницуОбъема * Источник.ОбъемРаботы, 3);
		    МенеджерЗаписи.КоличествоНаОбъемРаботы = СтрокаМатериал.КоличествоУпаковокНаЕдиницуОбъема * ПолучитьКоэффициентУпаковки(СтрокаМатериал.Упаковка)* Источник.ОбъемРаботы;
			  
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаМатериал);
			МенеджерЗаписи.Записать();
		КонецЦикла;
		
		Для Каждого СтрокаРесурс Из Источник.Ресурсы Цикл
			МенеджерЗаписи 	= РегистрыСведений.УСОERP_ПотребностьВРесурсах.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Работа			= Приемник.Ссылка;
			МенеджерЗаписи.ВидПланирования 	= Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный;	
			МенеджерЗаписи.ЗагрузкаПроцент  = СтрокаРесурс.Загрузка;
			МенеджерЗаписи.Период			= НачалоДня(ТекущаяДата());
			МенеджерЗаписи.АвторИзмерения   = Пользователи.ТекущийПользователь();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаРесурс);
			МенеджерЗаписи.Записать();
		КонецЦикла;
	КонецЕсли;	
	
	МенеджерЗаписи 	= РегистрыСведений.УСОERP_ПараметрыВыполненияРабот.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Работа				= Приемник.Ссылка;
	МенеджерЗаписи.ВидПланирования	 	= Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный;
	МенеджерЗаписи.Период	        	= НачалоДня(ТекущаяДата());
	МенеджерЗаписи.АвторИзменения   	= Пользователи.ТекущийПользователь();
	МенеджерЗаписи.ОбъемРаботы			= Источник.ОбъемРаботы;
	МенеджерЗаписи.ЕдиницаОбъема		= Источник.ЕдиницаОбъема;
	МенеджерЗаписи.ДлительностьПлан		= Источник.ДлительностьПлан;
	МенеджерЗаписи.ЕдиницаДлительности	= Источник.ЕдиницаДлительности;
	МенеджерЗаписи.Записать();
КонецПроцедуры	

#КонецОбласти

#Область Прочее

Функция ПолучитьКоэффициентУпаковки(ТекУпаковка)
	
	Если ЗначениеЗаполнено(ТекУпаковка) Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекУпаковка,"Числитель,Знаменатель,Объем,Вес");
		ТекКоэффициент = ?(ЗначенияРеквизитов.Знаменатель = 0 ИЛИ ЗначенияРеквизитов.Знаменатель = Неопределено,1,ЗначенияРеквизитов.Числитель/ЗначенияРеквизитов.Знаменатель);
		
		Если ТекКоэффициент = Неопределено Тогда
			
			ТекКоэффициент = 1;
			
		КонецЕсли;
		
	Иначе
		
		ТекКоэффициент = 1;
		
	КонецЕсли;
	
	Возврат ТекКоэффициент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
